{"course_id": "21w780", "course_description": ["This course has two parallel aims:", " To improve student writing about technical subject matters, including forms of writing commonly employed in technical organizations, and Critically to examine the nature of technologically-assisted communication, focusing somewhat on professional communication among scientists and engineers. We will often combine these two goals, by practicing critical investigation of communications technologies in written formats (and other media) that employ communications technologies. ", "Following the parallel aims of the course, there are primarily two types of course materials that we will study together. We will work on student writing by reading your writing in various media, and critiquing it as a group. We will also examine the nature of communications technologies by reading books and articles of philosophy and cultural theory. The readings will thus range from very concrete, empirical accounts to very abstract, philosophical texts, and you should certainly be prepared to deal with both extremes on the scale of abstraction.", "Rather than an overarching theme or a unifying project for the whole semester, our curriculum will jump each week to a new topic, building methods of critical inquiry along the way. We will study the construction of CVs and other materials relating to job acquisition. We will examine the possibilities and pitfalls of Microsoft® PowerPoint® presentations. We will consider the implications of the growing use of cell phones, and the social dimensions of WiFi networks. We will practice Web design and discuss the supposed rules for constructing good Web sites. Computer gaming, blogging, and electronic security will all pass before our critical gaze. Cutting across these many issues, writing assignments will often require the invention of new ideas for innovation in communication technology or critical examination of existing technologies.", "Activities", "There will be two major writing assignments, as well as numerous shorter assignments. See this listing and explanation of course assignments (PDF). Discussion of these written documents will constitute much of our class time. We will also spend some time writing in class, and editing as a group. In addition to traditional written papers, assignments will take different forms, including memos, proposals, and Web sites. Some assignments will be submitted in pairs or larger groups, depending on the number of students in the class."], "course_name": "Communicating in Technical Organizations", "course_prerequisites": []}