{"course_id": "ec701j", "course_description": ["D-Lab: Development is part of the D-Lab series of courses and field trips that prepare students to respond to the basic needs of low-income households and communities in developing nations with technological solutions that are inexpensive, ecologically sustainable and able to be implemented within the local context.", "This course introduces various notions of development, and explores several technological innovations that enhance the quality of life in these communities. The course also prepares students to focus on specific issues, such as the need for potable water, low-cost agricultural processing equipment, basic sanitation, and affordable energy, specifically in communities where students will travel during IAP [MIT's Independent Activity Period, a month-long intersession between fall and spring terms.] Students will develop working relationships with partnering institutions in developing nations to ensure that the field trips provide both a learning opportunity and an international social network to test the viability of technological solutions jointly crafted by the students and the hosting communities.", "D-Lab: Development begins with a historical understanding of why conventional developmental efforts have not universally enhanced the quality of life of low-income households and communities. This is followed by a series of hands-on workshops in which students learn practical approaches towards addressing these issues. These workshops are interspersed with discussions and case studies, led by the course staff and guest speakers who have developed and implemented technological solutions in specific topic areas such as: energy, lighting systems, agricultural technologies, low-cost housing, water, sanitation, micro enterprises, and health. The discussion of case studies also provides students the opportunity to select problem areas for deeper engagement during the IAP field trip. The third part of the course is focused on the preparation for the field trip by sensitizing students to the realities of fieldwork in unfamiliar settings, and discussing how to build enduring institutional relationships with communities for future collaboration. Students will work in small groups studying the history, culture, language, economy and politics of the communities they plan to visit during IAP to understand the context within which their particular technological innovations must be embedded.", "Graduate students taking the course for graduate credit will select a technology and/or an implementation strategy within a community organization and perform in-depth research and analysis to prepare a case study on the topic.", "Student Views on D-Lab, from MIT Admissions Blogs", "Paul B. '11. \"Introduction to D-Lab.\" October 2008.", "Office of Experiental Learning. \"Greetings from Honduras: D-Lab students in the field.\" January 18, 2012.", "Office of Experiental Learning. \"Greetings from Cambodia: D-Lab students in the field.\" January 25, 2012.", " Gain awareness of communities in the developing world and the technical challenges they face Learn about appropriate technologies for developing communities, their impact, and how they can be conceived, designed and implemented Understand the role MIT can play in helping and advancing developing communities throughout the world Learn the hands-on skills required to implement selected development projects Gain exposure to the culture, history, economic and developmental state of the host countries Work with community organizations to prepare projects for the IAP fieldtrips "], "course_name": "D-Lab I: Development", "course_prerequisites": []}