{"course_id": "7342", "course_description": ["Regeneration is widespread throughout the animal kingdom. Remarkably, planarian flatworms and hydra can regenerate an entirely new body. Salamanders can regenerate entirely new limbs, and fish can regenerate fins, spinal cords, and even heart tissue. Even mammals can regenerate digit tips, liver, and hair, and they must maintain the blood, skin and gut throughout adulthood. How does a regenerating animal \"know\" what's missing? How are stem cells or differentiated cells used to create new tissues during regeneration? We will take a comparative approach to explore this fascinating problem by critically examining classic and modern scientific literature about the developmental and molecular biology of regeneration. We will learn about conserved developmental pathways that are necessary for regeneration, and we will discuss the relevance of these findings for regenerative medicine.", "In this course, students will learn how to examine and evaluate primary scientific literature while learning principles of regeneration in animals. We will discuss two papers every week. At the end of each meeting a short (~15 minute) lecture will be given to introduce the background concepts and methodologies important for understanding the papers to be discussed in the next meeting. This course will provide a framework for understanding how biologists analyze gene function and cell lineage to uncover the molecular pathways and cellular processes involved in many types of regeneration in animals.", "Each week, we will read two primary scientific papers from the regeneration research literature. These include classic as well as contemporary papers that illustrate several fundamental principles of regeneration in animals. In each case, we will analyze what question was asked by the researchers, how they sought to answer this question experimentally, whether the results of their experiments and controls support their conclusions, and the implication of the results for regeneration biology. For some questions posed by the research, we will discuss how researchers might answer them experimentally in future work."], "course_name": "Developmental and Molecular Biology of Regeneration", "course_prerequisites": ["For proper assessment of the primary literature, students are expected to have completed: Genetics (7.03), General Biochemistry (7.05), or Cell Biology (7.06)."]}