{"course_id": "15225", "course_description": ["Increasingly, as markets or production bases, China and India are becoming important and integral players in the global economy. Foreign direct investment (FDI), portfolio investments and outsourcing businesses have increased dramatically in these two economies.", "Despite the rising importance of these two economies on the world stage, our knowledge and analysis of these two countries in an integrated manner has remained poor. On the one hand, analysts in the business community tend to lump the two countries together as a part of a homogenous group known as \"emerging markets\". This is so despite the substantial differences in their political systems, reform policies and business organizations. Academics have tended to treat the two countries separately, preferring to specialize in issues and questions specific to one or the other country.", "This is an experimental course, and its purpose is to bring these two countries together in an attempt to come up with a coherent framework which we can use to analyze these two countries. It should be acknowledged explicitly and upfront that there is a lot we do not know in terms of how to do this. It is heavily incumbent on the students in the course to provide perspectives, facts and viewpoints that will contribute to this effort. The course is designed to facilitate this effort. Our learning model is inductive, rather than deductive, and it is heavily based on class discussions and participation. The group projects should aim at integrating analysis, knowledge and understanding of these two countries.", "We start with \"macro\" perspectives on these two countries and then move to industry/firm-level analyses. The idea is to analyze the decisions and performance of firms in the greater political and economic contexts in which they operate. This is the emphasis of this course, i.e., we study the interface between firms and their business environments rather than assuming that business decisions are only driven by dynamics internal in a firm.", "We grapple with three broad questions in this course. (1) What are the essential features of the political and economic contexts for businesses in these two countries? (2) How have these contextual features shaped the performance and competitiveness of firms in them? (3) If one were to draw up a balance sheet of these two economies, what would it look like? In between, we have many specific questions and issues to address, such as the role of FDI in economic development, the growth and development of entrepreneurship, and the effect of globalization on local firms."], "course_name": "Economy and Business in Modern China and India", "course_prerequisites": []}