{"course_id": "200aj", "course_description": ["Exploration provides an exciting theme for student immersion and investigation of the sea, space and earth. This introduction to engineering subject uses a combination of project based active and experiential learning, with the explicit goals of fostering passion, excitement and creativity. The class will introduce core engineering themes, principles, and modes of thinking. Topics include: historical reflection, societal impact, fundamental principles, system uncertainties, teamwork, ethics, communications, engineering abstractions, constraints and boundaries. Rather than classic problem sets and exams, student teams complete space/earth/ocean exploration-based hands-on design project with weekly milestones. Specialized learning modules enable teams to focus on knowledge required to complete their projects, such as machine elements, electronics, software, acoustics, aero/hydrostatics, aero/hydrodynamics, structures, design process, visualization and communication. This is a CI course that will satisfy the pace requirement: Students must pass one CI by the end of the first year, and two CI subjects by the end of the second year.", "After completing 2.00AJ/16.00AJ, students will be able to:", " Actively participate (100%) in reading and discussing (including inquiry) the Exploration and Engineering FundaMentals materials (from reading assignments before class, in class, during laboratory sessions). Introduce, use, and calculate engineering fundamental principles. Propose and evaluate engineering designs (concepts, components, operational system) for human-operated robotic designs for sea, space and earth, and understand societal implications. Effectively communicate (written and oral), research and document engineering analysis and the design process for an operational system. Frame and resolve ill-defined problems, and design and operate a robotic vehicle for exploration. Participate as a contributing member of an engineering team comprised of 4-6 students. "], "course_name": "Exploring Sea, Space, & Earth: Fundamentals of Engineering Design", "course_prerequisites": []}