{"course_id": "17410", "course_description": ["This graduate course is in three Parts. Together they are intended to provide theoretical, empirical, and policy perspectives on source and consequences of globalization, focusing on emergent structures and processes, and on the implications of flows of goods and services across national boundaries – with special attention to the issue of migration, on the assumption that people matter and matter a lot. An important concern addressed pertains to the dilemmas of international policies that are shaped by the macro-level consequences of micro-level behavior.", "Part I defines the dimensions of globalization. The focus is on empirical evidence, propositions about the 'causal logic', cross-border issues, and evolving policy dilemmas. A conceptual distinction is made between conventional views of globalization shaped by the perspectives and priorities of comparative politics as a field that focus largely on the integration of national economies, and those of international relations, shaped by the priorities of the IR/IPE field -- addressing security and sovereignty issues that transcend national boundaries, question the implications of these boundaries as traditionally defined, and contribute to the transformation of inter-state, supra-state, and non-state relations.", "Part II is on crossing borders and focuses on sources, consequences, and modalities of migrations. The intent is to integrate a hitherto missing dimension of the study of international relations, namely the mobility of people – individually or collectively – and their implications for the configuration of the international system and relations among state and non-state actors. Special attention is given to matters of security, to the configuration of state systems and to sources and consequences of international conflict.", "Part III is on the processes by which changes take place in the international domain, influenced by emergent sources and consequences of globalization – and its particular manifestation in patterns of population movements. Particular attention is given to insights from international relations theory and IPE theory and policy of understanding institutional challenges and responses that transcend the conventional frame of the state system defined by territorial boundaries. The concluding session reviews known legacies of the 20th century to date – given emergent understandings of the complexity of globalization."], "course_name": "Globalization, Migration, and International Relations", "course_prerequisites": []}