{"course_id": "21w732", "course_description": ["Like other scientists, medical researchers and clinicians must be capable of presenting their work to an audience of professional peers. Unlike many scientists, however, physicians must routinely translate their sophisticated knowledge into lay terms for their own patients and for the education of the public at large. A surprising number of physicians write for less utilitarian reasons as well, choosing the narrative essay as a means of exploring the non-technical issues that emerge in their clinical practice. Over the course of the semester we will explore the full range of writings by physicians and other health practitioners. Some of the writer/physicians that we encounter will be Atul Gawande, Danielle Ofri, Richard Selzer, and William Carlos Williams. Students need have no special training, only a general interest in medicine or in public health issues such as AIDS, asthma, malaria control, and obesity. The writing assignments, like the readings, will invite students to consider the distinctive needs of different audiences. Assignments will include a critical review of two articles from The New England Journal of Medicine , a review article geared toward an audience of health professionals, a report suitable for general publication, two oral presentations, an autobiographical narrative, a resume and a job application letter. Students will learn to respond constructively to the work of others and to revise their own work in the light of comments from the instructor and from their peers.", "Any number of themes can provide a point of departure for an introductory writing course. My hope is that each of you can find something personally engaging and intellectually challenging in our joint exploration of \"perspectives on medicine and public health.\" While some of you may contemplate a future in medicine, I suspect that all of you can draw upon a personal experience that heightens your interest in some particular aspect of medicine. In any case, you need no special expertise to prosper in this course. We will begin by reading a series of essays about doctors and patients. Later in the semester, you will have the opportunity to follow your individual inclinations and to investigate a topic that intrigues you.", "The writing assignments will begin with those things that you know best-your own experiences and your own opinions-and move toward topics that are less personal and less familiar. If the going gets tough, you can count on the companionship and sympathy of your fellow students. This is a shared enterprise."], "course_name": "Introduction to Technical Communication: Perspectives on Medicine and Public Health", "course_prerequisites": []}