{"course_id": "1201j", "course_description": ["Introduction to Transportation Systems has two major goals:", "\nTo teach an understanding of the world of traveler and freight transportation:\r\n    How it works and how to think about analyzing and designing transportation systems?\nTo teach an appreciation of the multi-dimensionality of transportation issues, emphasizing:\r\n    \nTechnology\nSystems\nInstitutions\n\nand how transportation fits into a broader social/political/economic context involving:\n\nEnvironmental Issues\nEnergy Issues\nEconomic Development\nSustainability\nUrban Structure\nLand Use\nEquity\nEtc.\n\n\n", "The subject focuses on fundamental principles of transportation systems, introduces transportation systems components and networks, and addresses how one invests in and operates them effectively. The tie between transportation and related systems is emphasized.", "We discuss operating characteristics of various modes and intermodal combinations (transportation supply) and offer a perspective on \"customers\" (e.g., freight shippers, travelers) of transportation services and how they make transportation decisions (transportation demand).", "We introduce quantitative modeling ideas and various techniques and philosophies of modeling complex transportation enterprises. Also, conceptual \"frameworks\" for qualitative analysis are introduced (e.g., framework for strategic regional planning, institutional change analysis, new technology development and deployment).", "1.201J/11.545J/ESD.210J strives to be an interdisciplinary systems subject in the \"open\" sense. We look at transportation as a CLIOS (complex, large-scale, interconnected, open sociotechnical) system, where \"interconnected\" suggests transportation is linked to many other related societal systems, and recognize the broad impact of transportation system design and deployment decisions.", "1.201J/11.545J/ESD.210J is required for all first-year Master of Science in Transportation students. It would be of interest to, as well as accessible to, students in Urban Studies and Planning, Political Science, Technology and Policy, Management, and various engineering departments. It is a good subject for those who plan to take only one subject in transportation and serves as an entry point to other transportation subjects as well.", "While conducted as a graduate subject, motivated undergraduates interested in transportation and a broad perspective on large-scale systems are welcome."], "course_name": "Introduction to Transportation Systems", "course_prerequisites": []}