{"course_id": "4107", "course_description": ["The aim of the Portfolio Seminar is to assist in developing a critical position in relationship to their design work. By engaging multiple forms of representation, written and visual, students will explore methods that facilitate describing and representing their design work. Through a critical assessment of their existing portfolios, students will first be challenged to articulate design theses and interests in their past projects. Different mediums of representation will then be studied in order to hone an understanding of the relationship between form and content, and more specifically, the understanding of particular modes of representation as different filters through which their work can be read. Some of the questions that will be addressed are: ", "\nHow does one go about describing an image?\nHow does one theorize representation?\nHow does one articulate a design thesis in writing verses visual media?\nHow can the two interact to enhance each other?\nHow do different media, printed verses web publishing, affect the representation of work?\nHow is your work best communicated?\n", "The seminar will be structured around nine meetings that will be co-taught by Mark Jarzombek and Meejin Yoon. The first 3 meetings will involve discussions around written assignments. This will be followed by a review of student portfolio work, followed by several seminars around the issues of representation. Guest lecturers will be invited to lead some of these discussions. The other assignments for the course will include both a printed and web publication of one past project or design inquiry. The meetings will be weekly, scheduled so as to not interfere with studio and final reviews. Additional tutorials will be made available to assist students who are not as familiar with desktop and web publishing tools. Students are expected to arrive with a portfolio in hand. However, the course will not be focused on the mere improvement of an existing portfolio. The students will engage the representational process as a means to provide a critical forum for written and visual communication in the field of architecture and specifically within their own work.", "\n\nNeed help getting started?\nDon't show me this again\n\n", "\n\nDon't show me this again\nWelcome!\nThis is one of over 2,200 courses on OCW. Find materials for this course in the pages linked along the left. \nMIT OpenCourseWare is a free & open publication of material from thousands of MIT courses, covering the entire MIT curriculum.\nNo enrollment or registration. Freely browse and use OCW materials at your own pace. There's no signup, and no start or end dates.\nKnowledge is your reward. Use OCW to guide your own life-long learning, or to teach others. We don't offer credit or certification for using OCW.\nMade for sharing. Download files for later. Send to friends and colleagues. Modify, remix, and reuse (just remember to cite OCW as the source.)\nLearn more at Get Started with MIT OpenCourseWare\n\n"], "course_name": "MArch Portfolio Seminar", "course_prerequisites": []}