{"course_id": "7343", "course_description": ["The biological conversion of solar energy to chemical energy forms the basis of life as we know it. Knowledge of this fundamental process is critical to our understanding of the biogeochemical cycles that mitigate global warming. In this course, you will journey through the web of physical, chemical, and biological reactions that collectively constitute photosynthesis. We will begin with light harvesting and follow photons to the sites of primary photochemistry: the photoreaction centers. A molecular-scale view will show in atomic detail how these protein complexes capture and energize electrons. Then we will follow the multiple pathways electrons take as they carry out their work. Consequent reactions, such as the synthesis of ATP and the reduction of CO2 during the synthesis of carbohydrates, will also be discussed in structural detail. Lastly, we will delve into the evolution of these systems and also discuss other photosynthetic strategies, such as light-driven proton pumps and anoxygenic photosynthesis. The course will include a visit to an electron microscope to allow students to directly observe proteins involved in photosynthesis."], "course_name": "Photosynthesis: Life from Light", "course_prerequisites": ["As the goal of this course is to familiarize students with the reading and critical evaluation of the primary literature (research papers) in the field of photosynthesis, students are expected to have completed 7.03, 7.05, 7.06 or 7.08.", "\n\nNeed help getting started?\nDon't show me this again\n\n", "\n\nDon't show me this again\nWelcome!\nThis is one of over 2,200 courses on OCW. Find materials for this course in the pages linked along the left. \nMIT OpenCourseWare is a free & open publication of material from thousands of MIT courses, covering the entire MIT curriculum.\nNo enrollment or registration. Freely browse and use OCW materials at your own pace. There's no signup, and no start or end dates.\nKnowledge is your reward. Use OCW to guide your own life-long learning, or to teach others. We don't offer credit or certification for using OCW.\nMade for sharing. Download files for later. Send to friends and colleagues. Modify, remix, and reuse (just remember to cite OCW as the source.)\nLearn more at Get Started with MIT OpenCourseWare\n\n"]}