{"course_id": "801x", "course_description": ["Direct student experience with physics as an experimental science is rare in introductory college courses. The accompanying labs are often peripheral to the course (little credit, little involvement); and have set-piece experiments, sometimes with computers, that give students very little more feeling of how things really work than lecture demos or homework problems (valuable as these are).", "At MIT, starting in 1988, John King, Phylis and Philip Morrison, Tony French, and Peter Dourmashkin developed and taught two courses, Mechanics (8.01X) and Electricity & Magnetism (8.02X), in which experiments were central. For a 12-week course there are 8 to 10 experiments that are issued in kit form to student partnerships of two, along with instruments, all in two \"Red Boxes\" (small plastic toolboxes). Each student purchases (at cost) a tool kit with soldering iron, pliers, wire cutters and strippers, screw drivers, etc.", "The partners meet to assemble and run the experiments in their living quarters, take and analyze data, and turn in their notebooks for comment; thus the experiments are part of homework, which also has a reduced number of conventional problems.", "These experiments were made central to the course:", "\nBy connecting them closely to the theoretical presentations in lectures and text.\nBy taking 25 minutes out of the weekly 150 to discuss the experiment of the week, how to assemble the apparatus, how to troubleshoot, how to take, analyze and present data.\nBy having homework and test problems related to the experiments.\n", "Note that the mechanics experiments involve electrical construction and measuring techniques, no more mysterious than a stopwatch or PC. But here a digital multi-meter is taken as an instrument to use; in the E&M experiments analog meters are not only used but also understood-students learn all about how they work.", "Courses similar to these have been presented at Caltech, Harvard, and Ecole des Mines.", "All necessary materials can be found at local hardware and electronic supply store, or from KT Associates (207.442.9064, benkt@gwi.net), which supplies MIT.", "Besides the course syllabi and notes, and instructions for 12 basic constructions and experiments (Dourmashkin and King), there is a complete collection of 50 experiments (King, J. G., and A. P. French. Physics 8.01X and 8.02X Experiment Instructions. MIT Physics Department, 1998) that have been used at various times. Finally, there was a published book, ZAP!, designed to be used in conjunction with a version of these introductory physics courses taught at Caltech. Although out of print, the earlier (longer) version of ZAP! is still available from KT Associates (207.442.9064, benkt@gwi.net): King, J. G., and Philip & Phylis Morrison. ZAP! A Hands-on Introduction to Electricity and Magnetism. Preliminary ed. MIT Physics Department, 1991. ISBN: 0892784148.", "Physics I, 8.01X, covers the classical Newtonian mechanics syllabus of all the MIT first term physics subjects along with a set of take-home experiments. Topics covered include estimation, kinematics, force, Newton's Laws, energy, work, heat, momentum, collisions, torque, angular momentum, properties of materials, kinetic theory, introduction to the atom, and special relativity."], "course_name": "Physics I: Classical Mechanics with an Experimental Focus", "course_prerequisites": []}