{"course_id": "11366j", "course_description": ["This class starts from three assumptions. The first is that that any effort to really do something about sustainable development will involve change on a broad scale. Think of the transition to a hydrogen economy or, more topically, a substantial effort to address climate change. Either will involve a broad array of changes in technology and behavior that are initiated and develop in local contexts and that have the potential to affect the broader trajectory and pace of change. This makes the management of change, transitions, and development a central problem in sustainable development.", "Our second working assumption is that the way to learn about how to foster change and development is to try to do it. To this end we will work in the class with the Environmental Programs Office and MIT and the Community Planning Department of the City of Cambridge on steps to enhance sustainability that further the City's climate change protection plan. Climate change is not only a central concern in sustainable development, but is precisely the sort of broad problem that makes the efforts to foster innovation and \"manage\" change important and vexing. The Environmental Programs Office and the Community Planning Department will be our client and partner in this effort. The other members of the community include faculty, students and staff at MIT who have been working with the City on these concerns and others who are involved in related efforts.", "Our third assumption is that a successful effort to address climate change, and sustainable development more broadly, is unlikely to stem from an exclusive reliance on conventional forms of state regulation. The limits on the resources and competence of the state are circumscribed and the authority to regulate is limited. Public officials and others who want to address these problems must find another way to act, that may draw on limited regulatory authority, but also finds ways to engage the resources and initiative of a variety of organizations and individuals. The outcome of this commitment, which is in keeping with current trends in regulatory practice, is to look for a level of organization that differs from control in an organizational hierarchy and coordination in a market. We will develop an approach that is rooted in organizations and that brings actors into interaction across organizational boundaries.", "Etienne Wenger's image of a community of practice gives a sense of what we mean.", "\"Communities of practice are groups of people who share a concern, a set of problems, or a passion about a topic and who deepen their knowledge and expertise in this area by interacting on an ongoing basis. Engineers who design a certain kind of electronic circuit called phase-lock loops find it useful to compare designs regularly and to discuss the intricacies of their esoteric specialty. Soccer moms and dads take advantage of game times to share insights about the subtle art of parenting. Artists congregate in cafes and studios to debate the merits of a new style or technique. Gang members learn to survive on the street and deal with an unfriendly world. Frontline managers running manufacturing operations get a chance to commiserate, to learn about upcoming technologies, and to foresee shifts in power.", "These people don't necessarily work together every day, but they meet because they find value in their interactions. As they spend time together, they typically share information, insight, and advice. They help each other solve problems. They discuss their situations, their aspirations, and their needs. They ponder common issues, explore ideas, and act as sounding boards. They may create tools, generic designs, manuals, and other documents - or they may simply develop a tacit understanding that they share. However they accumulate knowledge they eventually become informally bound by the value they find in learning together . . . Over time they develop a unique perspective on their topic, as well as a body of common knowledge, practices, and approaches. They also develop personal relationships and established ways of interacting. They may even develop a common sense of identity. They become a community of practice.\" (Wenger, E., R. McDermott, and R. M. Snyder. Cultivating Communities of Practice. Cambridge, MA: Harvard Business School Press, 2002, pp. 4-5.)", "The class will help you understand and reason about how to engage the potential for change that exists in these kinds of relationships within and among organizations."], "course_name": "Planning for Sustainable Development", "course_prerequisites": []}