{"course_id": "3064", "course_description": ["3.064 Polymer Engineering is one of DMSE's three restricted electives in polymers (the others are 3.062 Polymer Chemistry and 3.063 Polymer Physics). 3.064 is aimed at design, including those aspects of processing, structure and properties of polymers needed in materials engineering designs using these materials.", "The subject carries 3-0-9 credit, so approximately three hours of outside work should follow each lecture hour. These outside hours will include a thorough reading of various sections of the McCrum text as assigned in the Schedule, and usually one engineering problem. The reading should be done before the next class meeting, and the problem should be turned in at the next class meeting as well. (Occasionally your personal schedule may force you to delay a day, but try to avoid this.) No penalty will be assessed for the occasional late submission. Grading will be based on the quality of the submitted problems, the vigor of your in-class discussion, the three quizzes, and the design you will present at the end of the term.", "Each student will develop a design for a polymeric load-bearing article (Click here (PDF) for an example design of a cupboard-door safety latch, such as would keep a toddler from getting at the cleaning fluids.) The design will culminate in an engineering drawing such as would be rendered with SolidWorks or AutoCAD , to include a specification of material and processing method. Materials selection calculations, stress analyses, etc., will be included in the design writeup. The design drawing will be imported into Microsoft PowerPoint or other presentation software, and presented to the class during session 38 and 39 respectively. You should be working toward this design during the entire term, and you should skim chapter 8 of McCrum early to get started.", "Student collaboration on homework is permitted and encouraged, but all work to be submitted should then be worked out and written up on your own. Copying directly from \"bibles\" or other such sources is cheating, although studying prior solutions can be an effective learning aid. Common sense should be exercized in this. Computer solutions are encouraged when appropriate; Maple is excellent for many of the assigned problems.", "There are no formal recitations, but you are encouraged to make frequent use of the Instructor's office hours for assistance or just informal discussion.", "\n\nNeed help getting started?\nDon't show me this again\n\n", "\n\nDon't show me this again\nWelcome!\nThis is one of over 2,200 courses on OCW. Find materials for this course in the pages linked along the left. \nMIT OpenCourseWare is a free & open publication of material from thousands of MIT courses, covering the entire MIT curriculum.\nNo enrollment or registration. Freely browse and use OCW materials at your own pace. There's no signup, and no start or end dates.\nKnowledge is your reward. Use OCW to guide your own life-long learning, or to teach others. We don't offer credit or certification for using OCW.\nMade for sharing. Download files for later. Send to friends and colleagues. Modify, remix, and reuse (just remember to cite OCW as the source.)\nLearn more at Get Started with MIT OpenCourseWare\n\n"], "course_name": "Polymer Engineering", "course_prerequisites": []}