{"course_id": "21l706", "course_description": ["The aim of this subject is to sharpen appreciation of film and literary fiction by studying the differences and similarities between the ways that filmed narratives and written narratives tell their stories. To this end we shall (1) imbibe and digest a modest amount of theory about narrative in general and how it works, and (2) view films and works of fiction in tandem. One way to proceed upon this enterprise is to study the filmed adaptations works of fiction, but we shall be taking another way. Each film will be paired with a work of literary merit which either deals with similar thematic materials and narrative situations, or else employs a technique of presentation that directly corresponds to a technique employed by the film with which it is paired. To illustrate this latter sort of relationship, we may note that Billy Wilders film, Sunset Boulevard, derives more from stories of vampires and possession than it does from social comedy, but both Wilder's film and Jane Austen's Pride and Prejudice depend importantly on the presence of a discernable narrative voice (in the case of Wilder's film, voice-over) whose capacities to comment on the action are superior to all the actors in the story and carries a large portion of the story's meaning and effect. For this reason, although the stories told by Wilder's film and Austen's novel have little or nothing to do with one another, we might study them in tandem.", "The films and literary fictions dealt with in this subject will be important each in their own right, and the point of our encounter with them will not only be to investigate narrative media but also to appreciate their artistic merits and the value of their conveyed view of life. The subject will pair, among others, works by Aeschylus and John Ford, Sophocles and Clint Eastwood, Shakespeare and Francis Coppolla, Henry James and Billy Wilder, Cervantes and Akira Kurosawa, Scott Fitzgerald and Orson Welles."], "course_name": "Studies in Film", "course_prerequisites": []}