{"course_id": "21l704", "course_description": ["William Butler Yeats occupies a dominant position in the lives and work of the Irish poets who followed him. We will explore some of that poetry, and consider how later poets, especially female poets, tried to come to grips with, or escape from, that dominance.", "As a seminar, the subject will place special emphasis on student involvement and control. I will ask you to submit one ten-twelve page essay, two shorter (five page) essays, and to accept the role of \"leadoff person,\" perhaps more than once, That role will demand that you choose from among the assigned readings for that session the poem we should focus upon, and to offer either a provocative articulation of what the poem is about, or a provocative question which the poem confronts, and which we should grapple with, as well. I have asked the Registrar to set up a class e-mail list. You will not be placed on the list unless and until you are fully and officially registered for the subject.", "It is my presumption that all work you present or submit is your own. Which raises the troublesome issue of plagiarism, the use of another's intellectual work without proper acknowledgement. This is a very serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and also that the instructor will turn the matter over to the Committee on Discipline. Please note that these responses are not within my power to vary or bypass.", "Full acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted. Ideas, arguments, and direct phrasings taken from someone else's work must be labeled and properly footnoted. Further guidance on the proper forms of attribution may be found in the style guides available in the Writing and Communication Center, and at the MIT Web site on plagiarism."], "course_name": "Studies in Poetry: 20th Century Irish Poetry: The Shadow of W. B. Yeats", "course_prerequisites": []}