{"course_id": "7346", "course_description": ["How do we find our favorite store in the mall? And how do we remember where we parked our car? By using simple animal models and sophisticated electrophysiological, biochemical and molecular biological methods, neuroscientists over the past 40 years have found fascinating answers to these questions. In this course we will discover how innovative technologies combined with profound hypotheses have given rise to our current understanding of neuroscience. We will study both new and classical primary research papers with a focus on the plasticity between synapses in a brain structure called the hippocampus, which is believed to underlie the ability to create and retrieve certain classes of memories. We will discuss the basic electrical properties of neurons and how they fire. We will see how firing properties can change with experience, and we will study the biochemical basis of these changes. We will learn how molecular biology can be used to specifically change the biochemical properties of brain circuits, and we will see how these circuits form a representation of space giving rise to complex behaviors in living animals. A special emphasis will be given to understanding why specific experiments were done and how to design experiments that will answer the questions you have about the brain.", "The course consists of weekly meetings during which primary research papers will be discussed. These papers will be introduced in the previous meeting and should be read prior to the class. Each week one or two questions will be distributed with the papers. Brief answers to the questions should be emailed to the instructor by the evening prior to discussion of the papers. The classes are designed to promote discussion of the papers. Students will be expected to be able to explain the material in the papers."], "course_name": "Synaptic Plasticity and Memory, from Molecules to Behavior", "course_prerequisites": ["7.03 Genetics\n7.05 General Biochemistry\n7.06 Cell Biology\nor\n7.28 Molecular Biology"]}