{"course_id": "21m670", "course_description": ["This course explores the forms, contents, and context of world traditions in dance that played a crucial role in shaping American concert dance. For example, we will identify dances from an African American vernacular tradition that were transferred from the social space to the concert stage. We will explore the artistic lives of such American dance artists as Katherine Dunham, Pearl Primus, and Alvin Ailey along with Isadora Duncan, Martha Graham, George Balanchine, and Merce Cunningham as American dance innovators. Of particular importance to our investigation will be the construction of gender and autobiography that lie at the heart of concert dance practice, and the ways in which these qualities have been choreographed by American artists.", "We will first look at the roots of classical ballet and its American presence via visiting ballerinas such as Fanny Essler and Marie Taglioni. From this we will trace a rise in performance venues; the Puritan resistance to dance as 'immoral;' and the breaking of tradition which allowed Isadora Duncan, Loie Fuller, and Ruth St. Denis to create a space for concert dance that was not ballet. We will unearth the streak of feminist independence which is at the root of modern dance practice. Martha Graham, Katherine Dunham, Pearl Primus, Agnes de Mille fit directly into this lineage as first-generation modern dance artists. Class lectures and discussions will analyze works created by these artists, taking into consideration a variety of historical and political contexts which gave rise to their inventions. Frequent viewing assignments will help students identify visual, musical, and kinesthetic underpinnings of choreographic structure.", "The requirements for this subject conform to the mechanical requirements for all HASS-D's and CI-H: There will be no fewer than three writing assignments that will add up to a minimum of 20 pages; one of these papers will be rewritten; and no less than one hour per week will be devoted to discussion."], "course_name": "Traditions in American Concert Dance: Gender and Autobiography", "course_prerequisites": []}